app/views/posts/_form.html.erb

          <h4 class="form__block__title2">Выберите, что вы делали?</h4>
        <%= form.select :category_id, Category.pluck(:name, :id) %>
---
SELECT "categories"."name", "categories"."id" FROM "categories"