app/controllers/norests_controller.rb

SELECT "norests".* FROM "norests"
---
  def index
    @norests = Norest.all

SELECT "norests".* FROM "norests" WHERE "norests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @norest = Norest.find(params[:id])

INSERT INTO "norests" ("name", "title", "content", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @norest = Norest.new(norest_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @norest.save

UPDATE "norests" SET "content" = ?, "updated_at" = ? WHERE "norests"."id" = ?  [["content", "<p>Не спал два дня, какой вообще сегодня<br />\r\nдень недели?<br />\r\nПро наличие отдыха вообще молчу...</p>\r\n"], ["updated_at", "2022-12-23 00:08:14.423709"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @norest.update(norest_params)

DELETE FROM "norests" WHERE "norests"."id" = ?  [["id", 2]]
---
  def destroy
    @norest.destroy

SELECT "norests".* FROM "norests" WHERE "norests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_norest
      @norest = Norest.find(params[:id])