app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at", "author", "image", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @post.save