app/controllers/userrs_controller.rb

SELECT "userrs".* FROM "userrs"
---
  def index
    userrs = Userr.all