app/views/layouts/application.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."display_in_navbar" = ?  [["display_in_navbar", 1]]
---
    <div class="top_menu">
      <% Category.where(display_in_navbar: true).each do |cat| %>